// 정확도가 74.2% 라면 출력값이 0 만 있을수 있어서 0과 1이 몇개나 있는 지 확인해보는 것도 좋을것 같아요
// 연령에 증가 따른 성공 확률이 감소하고 예외적으로 45-50이 43-44보다 약간 높게 나왔어요
// 표본수는 43-44의 약 만 2천개 45-50은 약 7천개 정도 2배 차이가 나고요
// 임신 경험이나 출산 경험에 따른 성공율은 크게 없었어요
// 이식된 배아 수는 안받은 사람과 받은 사람의 차이는 있지만 받은 숫자의 차이에 따른 큰 변화는 없었습니다
// 불임원인의 합은 오히려 임신 성공한 사람이 실패한 사람보다 많았습니다

// 1. port를 열어서 colab을 여는 방법
// 2. ipykernel <= pip를 설치 후 하는 방법
// 3. 익스텐션을 설치해서

// 생각을해서 가장좋은 방법으로 업데이트 하겠습니다.

// 1. 실패 전용 피처 7개 6개
// 2. target_encoding

// 3 피처 선택 자동화
// 5. 기존 파일 앙상블

// # 4. Pseudo Labeling
